/**
 *   Один из способов создать файл или каталог со случайным
 *   именем состоит в том, чтобы сгенерировать случайное число типа
 *   BigInt и преобразовать его в систему счисления по
 *   основанию 36, в результате получится строка, такая как
 *   "qsnvbevtomcj38o06kul". Отыщите в Scaladoc методы, которые можно было бы использовать для этого.
 *   Чтобы сгенерировать случайно число типа BigInt можно воспользоваться методом Random, для преобразования
 *   полученного числа в 36-ричную систему счисления необходимо воспользоваться ...(не нашёл подходящих методов,
 *   кроме перевода в 16-ричную(toHexString), 8-ричную(toOctalString), 2-ичную системы(toBinaryString) счисления)
 */
object Exercise_8 {
}
