

class ListInfo:
    """
    Списки в Python - упорядоченные изменяемые коллекции объектов произвольных типов
    (почти как массив, но типы могут отличаться).
    Ссылка:     https://pythonworld.ru/tipy-dannyx-v-python/spiski-list-funkcii-i-metody-spiskov.html
    """
    #Чтобы использовать списки, их нужно создать. Создать список можно несколькими способами.

    #pass
    '''
    Команда pass нужна пока не введена ни одна из функций def
    '''
    def list_help(self):
        '''
        Например, можно обработать любой итерируемый объект (например, строку 'список')
        встроенной функцией list() и получить >>> ['с', 'п', 'и', 'с', 'о', 'к']
        '''


